// UNIT - 1
// ----------------- //

// let a;
// let b;
// let c;

// a = a + 2;
// b = b - 5;
// c = c + "world!";

// console.log(a); // 36
// console.log(b); // 15
// console.log(c); // "Hello world!"

// ----------------- //

// "HTML, CSS, JS, React, Node, React Native, PHP, Vue"
// Дізнатись чи містится у рядку "js"
// Дізнатись на якій позиції знаходится "php"

// ----------------- //

// Попросити користувача ввести email prompt().
// Вивести довжину email у консоль.
// Привести email до нижнього регістрa.
// Перевірити чи email містить 'goit'.

// ----------------- //

// Попросити користувача загадати число.
// Потім він повинен помножити це число на 2 і додати до отриманого результату 7.
// Те, що вийшло в результаті, потрібно ввести у діалоговому вікні - prompt().
// Видати користувачеві його число.

// ----------------- //

// Написати код, який гернерує рандомне число від 1 до 5 // Math.round(Math.random() * (5 - 1)) + 1
// Попросити користувача вгадати це число та вивести у консоль true/false

// ----------------- //

// const ADMIN_EMAIL = "admin@goit.com";
// const ADMIN_PASSWORD = "qwerty123";

// Попросити користувача ввести email і пароль.
// 1) Якщо пароль та пошта співпадають, вивести в діалогове вікно 'Login: true, Password: true', якщо ні - false
// 2) Якщо пароль та пошта співпадають, вивести в діалогове вікно 'Access: true', якщо ні - false

// UNIT - 2
// ----------------- //

// Попросити користувача ввести число більше 100
// Вивести результат у консоль

// ----------------- //

// const ADMIN_PASSWORD = "qwerty123";
// Попросити користувача ввести пароль
// Порівняти паролі та вивести результат користувачеві - You are logined/Password is wrong

// ----------------- //

// Попросити в користувача ввести тип підписки
// За допомогою switch вивести користувачу ціну за підписку
// free - 0
// standard - 100
// pro - 300
// platinum - 500
// Якщо користувач ввів невірний тип підписки, вивести помилку і попросити ввести знову

// ----------------- //

// Попросити користувача ввести email - prompt().
// Перевірити чи довжина email не перевищує довжину 20 символів, якщо перевищує вивести помилку - alert().
// Привести email до нижнього регістрa.
// Перевірити чи email містить '@goit.com'. Якщо містить, вивести користовачу, що він зареєстрований.

//TODO - переписати задачу на цикл do{...} while (condition)

// ----------------- //

// Вивести у консоль за допомогою циклу всіх видів цикла числа від 1 до 10
// Вивести у консоль всі непарні числа від 1 до 50

// ----------------- //

// Попросити користувача ввести число більше 100
// Якщо число меньше, попросити знову
// Якщо число більше, вивести число у консоль
// Якщо користувач натиснув "Відміна", вивести користувачеві "Ще раз натиснеш це, я ображусь("

// ----------------- //
