// UNIT - 1
// ----------------- //

// const person = {
//   name: "Max",
//   login: "max1122",
//   age: 25,
//   password: "qwerty123",
//   statistic: { friends: 23, views: 252 },
// };

// Вивести у консоль name, age, password двома способами
// Змінити password на 'qwe444qwe'
// Змінити friends на 30
// Додати властивість email
// Вивести у консоль масив всіх ключів об'єкта
// Вивести у консоль всі ключі об'єкта по черзі
// Вивести у консоль масив всіх властивостей об'єкта
// Вивести у консоль всі властивості об'єкта по черзі
// Вивести у консоль масив всіх значень об'єкта у форматі - [['ключ','значення'],['ключ','значення'],['ключ','значення']]
// Видалити властивість statistic

// ----------------- //

// Написати функцію, яка перевіряє, чи є елемент простим об'єктом, а не масивом і не null

// ----------------- //

// Написати функцію, яка буде повертати новий об'єкт без вказаних значень without({a: 1, b: 2, c: 3}, ['b', 'c']) // { a: 1 }

// ----------------- //

// Написати функцію, яка буде зрівнювати два об'єкта а ідентичність

// const obj1 = { a: 1, b: 2, c: 3 };
// const obj2 = { a: 1, b: 3, c: 3 };
// const obj3 = { a: 1, b: 3, c: 3, d: 5 };
// const obj4 = { a: 1, b: 2, c: 3 };

// ----------------- //

// const users = [
//   { username: "max2244", likes: 56, password: "qwert123" },
//   { username: "alex562", likes: 44, password: "adqbe512" },
//   { username: "julia858", likes: 90, password: "211sdg3" },
// ];

// Написати функцію, яка поверне середню кількість лайків усіх користувачів
// Написати функцію, яка буде знаходити юзера за його ім'ям
// Написати функцію, яка буде змінювати пароль користувача
// Написати функцію, яка буде створювати нового користувача
