// UNIT - 1
// ----------------- //

// const arr = ["Alex", "Mango", "Kiwi", "Apple"];
// Вивести довжину масива у консоль
// Вивести у консоль перший, третій, останній елемент масиву
// Замінити третій елемент на "Ajax", останній на "Poly"
// За допомогою циклу вивести всі елементи масива у консоль (for / for...of...)

// ----------------- //

// const arr = [1, 2, 3, 4, 5];
// Створити копію масиву

// ----------------- //

// const poem = "Ой у лузі червона калина";
// Попросити користувача ввести номер слова та замінити його на слово яке введе користувач
// Вивести користувачеві нове речення

// ----------------- //

// Створити масив та заповнити його числами від 1 до 10
// Написати код який буде повертати цей масив у зворотньому порядку

// ----------------- //

// Написати код який створить новий масив без повторів
// const arr = [1, 2, 3, 4, 3, 2, 5, 1, 6, 6, 7, 2];

// ----------------- //

// const arr = ["Poly", undefined, "Mango", "Ajax", false, null, 'Max', 0];
// Написати код, який створить новий масив без falsy значень

// ----------------- //

// Написати код, який буде зрівнювати два масива на ідентичність
// const arr1 = [1, 2, 3, 4, 5];
// const arr2 = [1, 2, 3, 4, 5];
// const arr3 = [1, 2, 3, 4, 5, 6];
// const arr4 = [1, 2, 3, 5, 4];
// Зрівняти ці масиви

// ----------------- //
